Revit 2026 API

# IFCLinkPosition Enumeration

---

IFC Link Position within the Host Document.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IFCLinkPosition
```
```vb
Public Enumeration IFCLinkPosition
```
```cpp
public enum class IFCLinkPosition
```
```fsharp
type IFCLinkPosition
```

| Member name | Value | Description |
| --- | --- | --- |
| InternalOrigin | 0 | Link IFC Origin to Revit Internal Origin. |
| ProjectBasePoint | 1 | Link IFC Origin to Project Base Point. |
| SurveyPoint | 2 | Link IFC Origin to Survey Point. |

#### Reference

Autodesk.Revit.DB.IFC Namespace